UTAF_Base/requestFiles/BPS_Account_Modify.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v2.account.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
          <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         <!--Optional:-->
         <urn:endUserId>id000000</urn:endUserId>
         <!--Optional:-->
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         <!--Optional:-->
         <urn:propagatedKey>?</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataModify version="2.1">
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id000000</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:billingAccountId>${Req_billingAccountId}</urn1:billingAccountId>
         <urn1:partyId>${Req_partyId}</urn1:partyId>
         <urn1:paymentAgreementId>${Req_paymentAgreementId}</urn1:paymentAgreementId>
         <urn1:nameModTime>${Req_nameModTime}</urn1:nameModTime>
         <urn1:officialNameName>${Req_officialNameName}</urn1:officialNameName>
         <urn1:firstName>${Req_firstName}</urn1:firstName>
         <urn1:printName>${Req_printName}</urn1:printName>
         <urn1:titleCode>${Req_titleCode}</urn1:titleCode>
         <urn1:legalFormCode>${Req_legalFormCode}</urn1:legalFormCode>
         <urn1:careOfInd>${Req_careOfInd}</urn1:careOfInd>
         <urn1:urbanAddressStartDate>${Req_urbanAddressStartDate}</urn1:urbanAddressStartDate>
         <urn1:futureLanguageIso2Code>${Req_futureLanguageIso2Code}</urn1:futureLanguageIso2Code>
         <urn1:houseNbr>${Req_houseNbr}</urn1:houseNbr>
         <urn1:alphaHouseNbr>${Req_alphaHouseNbr}</urn1:alphaHouseNbr>
         <urn1:streetCode>${Req_streetCode}</urn1:streetCode>
         <urn1:cityCode>${Req_cityCode}</urn1:cityCode>
         <urn1:countryIso3Code>${Req_countryIso3Code}</urn1:countryIso3Code>
         <urn1:residenceName>${Req_residenceName}</urn1:residenceName>
         <urn1:boxNbr>${Req_boxNbr}</urn1:boxNbr>
         <urn1:apartmentNbr>${Req_apartmentNbr}</urn1:apartmentNbr>
         <urn1:blockNbr>${Req_blockNbr}</urn1:blockNbr>
         <urn1:floorNbr>${Req_floorNbr}</urn1:floorNbr>
         <urn1:industrialZone>${Req_industrialZone}</urn1:industrialZone>
      </urn1:RequestDataModify>
   </soapenv:Body>
</soapenv:Envelope>